{"id":4698,"date":"2020-05-17T16:06:08","date_gmt":"2020-05-17T16:06:08","guid":{"rendered":"https:\/\/www.elaarimmigration.ca\/?p=4698"},"modified":"2021-03-10T07:15:31","modified_gmt":"2021-03-10T07:15:31","slug":"study-opportunities-found-in-canada-to-support-a-dream","status":"publish","type":"post","link":"https:\/\/www.elaarimmigration.ca\/blog\/study-opportunities-found-in-canada-to-support-a-dream\/","title":{"rendered":"Study opportunities found in Canada to support a dream."},"content":{"rendered":"<p>Gulbag Singh wanted to add international studies to his education, and <strong>Colossus Migration helped him find the right fit in Canada<\/strong>.<\/p>\n<p>Perhaps one of the most honourable reasons to pursue success is to make a better life for family members. Unfortunately, no matter how achievable the dream may seem, there may be a need for help from someone in another country to make it happen. This was the case for Gulbag Singh.<\/p>\n<p>Gulbag is from Punjab, <strong>India<\/strong> and has a dream of becoming a successful businessman to enable him to support his family members. His background education in the high-demand field of software development was a good start. He wanted to add an international education in business as well as some relevant experience to allow him to start his venture. Obviously, schools in his homeland couldn’t deliver what he wanted, but he was able to find the help he needed.<\/p>\n<div id=\"attachment_4707\" style=\"width: 414px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-4707\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-4707\" src=\"https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-1024x1024.jpeg\" alt=\"Gulbag in India\" width=\"404\" height=\"404\" srcset=\"https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-1024x1024.jpeg 1024w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-150x150.jpeg 150w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-300x300.jpeg 300w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-768x768.jpeg 768w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-100x100.jpeg 100w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-140x140.jpeg 140w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-500x500.jpeg 500w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-350x350.jpeg 350w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-1000x1000.jpeg 1000w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1-800x800.jpeg 800w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image1-1.jpeg 1077w\" sizes=\"(max-width: 404px) 100vw, 404px\" \/><p id=\"caption-attachment-4707\" class=\"wp-caption-text\"><em>Gulbag Singh in India<\/em><\/p><\/div>\n<p>“The best thing about Canada is the environment and the infrastructure, which I couldn’t find in India,” he says.<\/p>\n<p>Initially, due to the information he’d seen while growing up and the childhood dreams he’d formed, Gulbag thought he’d go to the <strong>United States of America to study<\/strong>. He learned that there were certain aspects of studying and living in the USA that weren’t beneficial to him, so he switched his focus to Canada.<\/p>\n<p>“Going to the USA was my first priority when I was beginning to think about where to do my studies,” he says. “I would love to visit the United States. Hopefully, in the near future.”<\/p>\n<p>Although he’d changed his plans, it still wasn’t as simple as making the decision to <strong>study in Canada<\/strong> and hop on a plane. As Gulbag explains, he was nervous about <strong>applying for a Canada student visa<\/strong> because he had heard from a number of people that there were quite a few student visa requests being turned down. At about that time, he spoke to his cousin, who lives in Surrey, BC.<\/p>\n<p>“He told me, ‘I have a friend who is an excellent immigration consultant,’” Gulbag explains. “That’s how I came to know about Keshav Sharma and Colossus Migration.”<\/p>\n<p>Keshav was able to explain the process of applying for the Canada student visa to Gulbag, and he decided to engage the services of Colossus Migration.<\/p>\n<p>When faced with the IELTS (English language test), Gulbag didn’t score as high as he’d hoped, and Keshav explained that most schools require an extra semester that includes English study in such cases. They both wanted to avoid this as it would represent an additional semester of time and costs, and with Gulbag’s goals of one day supporting his family, keeping costs down was necessary.<\/p>\n<p>“It was important for me to explain how the immigration process works to Gulbag so that there would be no surprises for him,” Keshav says. “Not everyone who wants to study in Canada is successful in obtaining their student visa, but with a well-prepared application, the chances are much higher.”<\/p>\n<p>Keshav began by listening carefully to understand what Gulbag wanted from his studies in Canada and developed a shortlist of post-secondary institutions that were likely to admit Gulbag without the additional English semester requirement. The list created by Colossus Migration focused on the best options from schools carefully selected from all the possibilities throughout the country.<\/p>\n<p>Gulbag had already earned his Bachelor of Vocational Studies in Software Development from Guru Nanak Dev University in Amritsar, Punjab, so he was familiar with what was required in terms of studying at a post-secondary institution. He wanted to add the education and understanding of North American business practices and principles to grow his global knowledge base to give his future business a higher chance of success.<\/p>\n<p>He applied to three schools: NAIT (Northern Alberta Institute of Technology) in Edmonton, Alberta, Conestoga College in Kitchener, Ontario and Langara College in Vancouver, BC.<\/p>\n<p>While waiting for word of his admission, Gulbag and Keshav started putting together Gulbag’s study visa application via email and phone. The process was quite an accomplishment given that the applicant was in Punjab, while the <strong>immigration consultant was in Vancouver, BC, Canada<\/strong>.<\/p>\n<p>“It was a tough time for me to wait because every day, I was just praying to God to bless me,” Gulbag says. “And he did.”<\/p>\n<p>Keshav contacted Gulbag to let him know the good news. He had been offered the option to study at Conestoga College without the additional semester requirement. Now the pair needed to focus on finalizing his study visa application. Everything fell into place perfectly despite the challenges of different countries and time zones. Gulbag was approved to study in Canada thanks to the experience and knowledge of <a href=\"https:\/\/www.elaarimmigration.ca\/\"><strong>Colossus Migration<\/strong><\/a>.<\/p>\n<div id=\"attachment_4702\" style=\"width: 404px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-4702\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-4702\" src=\"https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-1024x1024.jpeg\" alt=\"Gulbag in Canada\" width=\"394\" height=\"394\" srcset=\"https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-1024x1024.jpeg 1024w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-150x150.jpeg 150w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-300x300.jpeg 300w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-768x768.jpeg 768w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-100x100.jpeg 100w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-140x140.jpeg 140w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-500x500.jpeg 500w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-350x350.jpeg 350w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-1000x1000.jpeg 1000w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1-800x800.jpeg 800w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/05\/image0-min-1.jpeg 1280w\" sizes=\"(max-width: 394px) 100vw, 394px\" \/><p id=\"caption-attachment-4702\" class=\"wp-caption-text\"><em>Gulbag Singh in Canada<\/em><\/p><\/div>\n<p>“Luckily, I got accepted here, to Conestoga College,” Gulbag says. “I came to Canada on the 13th of August, 2019. I am currently enrolled in the school of business and have successfully completed two semesters here.”<\/p>\n<p>He has found his studies to be easy when compared to what he experienced in India and is enjoying living in Canada.<\/p>\n<p>“Canada is a multicultural country and has so many beautiful things like Niagara Falls and the CN Tower,” he says. “Keshav is a really good person who helped me a lot to get here. I will be thankful to him for my entire life.”<\/p>\n<p>Gulbag credits Keshav’s professionalism, experience and expertise with the fact that he is now studying <strong>business in Canada<\/strong>. The fact that Keshav understood Gulbag’s situation and needs making it that much easier. Gulbag will complete his studies at Conestoga in April 2021 when he wraps up his two-year program. At that time, he will review his options to determine what is best for him and his family.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gulbag Singh wanted to add international studies to his education, and Colossus Migration helped him find the right fit in Canada. Perhaps one of the most honourable reasons to pursue&#8230;<\/p>\n","protected":false},"author":5,"featured_media":4702,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[254,141],"tags":[],"_links":{"self":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/4698"}],"collection":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/comments?post=4698"}],"version-history":[{"count":9,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/4698\/revisions"}],"predecessor-version":[{"id":5854,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/4698\/revisions\/5854"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media\/4702"}],"wp:attachment":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media?parent=4698"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/categories?post=4698"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/tags?post=4698"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}