{"id":4967,"date":"2020-06-15T06:54:05","date_gmt":"2020-06-15T06:54:05","guid":{"rendered":"https:\/\/www.elaarimmigration.ca\/?p=4967"},"modified":"2021-10-19T10:19:03","modified_gmt":"2021-10-19T10:19:03","slug":"all-about-intra-company-transferee-work-permit","status":"publish","type":"post","link":"https:\/\/www.elaarimmigration.ca\/blog\/all-about-intra-company-transferee-work-permit\/","title":{"rendered":"All about Intra-Company Transferee Work Permit."},"content":{"rendered":"<p>Are you working for an organization that has its parent company, subsidiary, branch or affiliate in Canada? If yes, you may be able to obtain a <a href=\"https:\/\/www.elaarimmigration.ca\/work-permit-canada\/\"><strong>work permit in Canada<\/strong><\/a> under the Intra-Company Transferee (ICT) program.<\/p>\n<p><em><strong>What is Intra-Company Transferee (ICT) program???<\/strong><\/em><\/p>\n<p>The <strong>Intra-Company Transferee program<\/strong> allows international organizations to temporarily transfer qualified employees to Canada to improve management efficiency and expand Canadian exports and enhancing effectiveness in overseas markets.<\/p>\n<p>Intra-Company Transferees are allowed entry into Canada as per Immigration and Refugee Protection Regulations and related provisions and as is complimented by provisions of international trade agreements.<\/p>\n<p><strong>TRADE AGREEMENTS [R204 (a)] – <\/strong>According to this provision of Immigration and Refugee Protection Act (IRPA), intra-company transferees are eligible for LMIA exempt work permit under exemption code  T24, if there is a free trade agreement between their country and Canada. Canada has the following free trade agreements with other partner countries:<\/p>\n<p>North American Free Trade Agreement (NAFTA) and now the new United States Mexico Canada (USMCA) Trade Agreement<\/p>\n<p>Comprehensive Economic and Trade Agreement (CETA)<\/p>\n<p>Peru-Canada Free Trade Agreement<\/p>\n<p>Chile-Canada Free Trade Agreement<\/p>\n<p>Korea-Canada Free Trade Agreement and<\/p>\n<p>Colombia-Canada Free Trade Agreement<\/p>\n<p><strong>CANADIAN INTERESTS [R205 (a)] – <\/strong>Under this provision, intra-company transferees are granted LMIA exempt work permits under exemption code C12 as they provide significant <strong>economic benefit to Canada<\/strong> through the transfer of their expertise to Canadian businesses. This applies to foreign nationals from any country, including General Agreement on Trade in Services (GATS).<\/p>\n<p>Companies that bring international employees to Canada under Intra-Company Transferee are exempted from obtaining a Labour Market Impact Assessment (LMIA). It is to make the process simpler, faster, and economical than the LMIA route. The most significant advantage for Intra-Company Transferees is that the individual has a strong chance of being a permanent resident of Canada. If an individual obtains <strong>permanent residency in Canada<\/strong>, the individual can live and <strong>work in Canada permanently<\/strong>.<\/p>\n<p>Foreign investment and a qualified workforce are vital for a growing economy. Thus, multi-national businesses are encouraged to <strong>invest in Canada<\/strong>. The Canadian government also grants temporary work for eligible key employees from other countries. These types of arrangements help the growth of foreign businesses in Canada. It leads to the contribution by MNCs to Canada&#8217;s economy and higher job opportunities in the nation. ICT helps LMIA-exempt work permit to Canada.<\/p>\n<p>You can refer to our website to understand more about different <a href=\"https:\/\/www.elaarimmigration.ca\/immigration\/canada-work-visa-options-and-processes\/\" target=\"_blank\" rel=\"noopener\">work visa options<\/a> and processes.<\/p>\n<p>Intra-Company Transferees are allowed entry into Canada as per Immigration and Refugee Protection Regulations and related provisions and as is complimented by provisions of international trade agreements.<\/p>\n<p><em><strong>EXAMPLE FOR INTRA-COMPANY TRANSFEREE (ICT) PROGRAM<\/strong><\/em><\/p>\n<p>Shreya is an Indian citizen. She is the Chief Technology Officer for a multi-national company based in <strong>India<\/strong>. The company has multiple offices in India, one office in Singapore, and two in Canada. To increase its North American business, the company intends to transfer Shreya to Canada. Shreya wants to work in Canada for two years and is willing to apply for a Canada work visa. For a smoother transfer, Shreya speculates if she qualifies for Canada work visa under the Intra-Company Transferee work permit (ICT).<\/p>\n<p><em><strong>BUSINESS QUALIFICATIONS UNDER INTRA-COMPANY TRANSFEREE <\/strong><\/em><\/p>\n<p>Under Intra-Company Transferee, a qualified business is a multi-national company with a branch, affiliation, parent or subsidiary in Canada. Here are some definitions for such companies –<\/p>\n<p><strong>BRANCH<\/strong> – The Company&#8217;s branch entirely belongs to the company, but the address for the branch is different.<\/p>\n<p><strong>AFFILIATION<\/strong> – If three subsidiaries are owned by a parent company or an entity, each of the three subsidiaries will be considered an affiliate.<\/p>\n<p><strong>PARENT COMPANY<\/strong> – If an enterprise owns one or more subsidiaries, it will be considered a parent company.<\/p>\n<p><strong>ENTERPRISE <\/strong>– An enterprise is an entity that can be either for-profit or non-profit purposes. Therefore, the entity can be in the form of a joint venture, partnership, sole proprietorship, trust or a corporation.<\/p>\n<p><strong>SUBSIDIARY <\/strong>– If a parent company owns half of an entity, then it will be legally termed as a subsidiary of the parent company. Anyhow, the entity must be under the veto power of the parent company. Sometimes less than half of the subsidiary may be owned by the parent company. Anyhow, the control must reside with the parent company in such situations.<\/p>\n<p>One should consult other sources for further explanation or official definitions. The entity must be active and have a good track record as just having a subsidiary or branch is not good enough. Nevertheless, the expectations of the officers could vary according to the LMIA exemption codes.<\/p>\n<p><em><strong>ELIGIBLE EMPLOYEES FOR INTRA-COMPANY TRANSFEREE<\/strong><\/em><\/p>\n<p>The employee who is willing to <strong>apply for Canada&#8217;s work visa<\/strong> under ICT should have served the firm for at least a year in the past three years. The <a href=\"https:\/\/www.elaarimmigration.ca\/canada-immigration\/\"><strong>Canada immigration<\/strong><\/a> authorities expect a full-time position in one of the below-mentioned roles:<\/p>\n<p>EXECUTIVES – This includes:<\/p>\n<ul>\n<li>The Chief Financial Officer (CFO)<\/li>\n<li>The Chief Executive Officer (CEO)<\/li>\n<li>The Chief Technology Officer (CTO), and so on<\/li>\n<\/ul>\n<p><strong>SENIOR MANAGERS<\/strong> – The employees who manage several other workforces of the firm do not include the junior managers and front line workforce.<\/p>\n<p><strong>FUNCTIONAL MANAGERS<\/strong> – The employees who may not administer other employees but do work at the senior level and are vital for making decisions favourable for business.<\/p>\n<p><strong>SPECIALIZED KNOWLEDGE WORKERS<\/strong> – Someone who has been with the firm for a few years and possesses outstanding expertise.<\/p>\n<p>To know the exact meaning of these terms, you may contact a Canada immigration consultant to make sure which position is <strong>eligible for Canada<\/strong> work visa under the intra-company transferee (ICT) program.<\/p>\n<p><em><strong><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-4970\" src=\"https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/06\/checklist-box-PTH8EMY-min-1024x683.jpg\" alt=\"\" width=\"624\" height=\"416\" srcset=\"https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/06\/checklist-box-PTH8EMY-min-1024x683.jpg 1024w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/06\/checklist-box-PTH8EMY-min-300x200.jpg 300w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/06\/checklist-box-PTH8EMY-min-768x513.jpg 768w, https:\/\/www.elaarimmigration.ca\/wp-content\/uploads\/2020\/06\/checklist-box-PTH8EMY-min-900x600.jpg 900w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/strong><\/em><\/p>\n<p><em><strong>WORK PERMIT CANADA AND INTRA-COMPANY TRANSFEREE (ICT)<\/strong><\/em><\/p>\n<p>Intra-company transferee should be updated with the program information when a candidate applies for a Canada work visa under this program.<\/p>\n<p>The Canada immigration officers usually issue a one year Canada work visa to each candidate. Depending on the situation, the initial Canada work visa could be eligible for three years. The candidate may ask for the extension of work permit depending on the duration of the work permit if it is of a year or three years. For a management position, the maximum period of work permits could be for seven years. Similarly, for specialized workers, the maximum duration work permit could be issued for five years.<\/p>\n<p>The tables below explain the potential validity of Intra-Company Transferee for work permit Canada immigration.<\/p>\n<table style=\"height: 433px;\" width=\"744\">\n<tbody>\n<tr>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\"><strong>SITUATION<\/strong><\/span><\/p>\n<\/td>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\"><strong>MAXIMUM INITIAL PERMIT<\/strong><\/span><\/p>\n<\/td>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\"><strong>MAXIMUM EXTENSION DURATION<\/strong><\/span><\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">Management designation for a Canadian start-up<\/span><\/p>\n<\/td>\n<td style=\"text-align: center;\" width=\"205\"><span style=\"color: #993300;\">1 Year<\/span><\/td>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">7 Years<\/span><\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">Management designation for an active firm in Canada<\/span><\/p>\n<\/td>\n<td style=\"text-align: center;\" width=\"205\"><span style=\"color: #993300;\">3 Years<\/span><\/td>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">7 Years<\/span><\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">Specialized jobs for Canadian start-ups<\/span><\/p>\n<\/td>\n<td style=\"text-align: center;\" width=\"205\"><span style=\"color: #993300;\">1 Year<\/span><\/td>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">5 Years<\/span><\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">Specialized jobs for an active firm in Canada<\/span><\/p>\n<\/td>\n<td style=\"text-align: center;\" width=\"205\"><span style=\"color: #993300;\">3 Years<\/span><\/td>\n<td width=\"205\">\n<p style=\"text-align: center;\"><span style=\"color: #993300;\">5 Years<\/span><\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>It depends on the Canada immigration officer to issue the <strong>duration of the work permit<\/strong>. On the other hand, the candidate should make sure to submit all the necessary and relevant documents to convince the Canada immigration officer to receive the expected duration work permit.<\/p>\n<p><em><strong>DOCUMENTS FOR WORK PERMIT &#8211; INTRA-COMPANY TRANSFEREE<\/strong><\/em><\/p>\n<p>The precise checklist of the relevant documents depends on the candidate&#8217;s nationality, LMIA exemption code and few other factors such as –<\/p>\n<ul>\n<li>Proof of the company is legitimate in terms of the size of the firm, the ability to hire Canadian employees, and so on.<\/li>\n<li>The candidate must qualify all the requirements for ICT.<\/li>\n<li>The complete process must not be a scheme for undermining the immigration laws set by Immigration Refugee and Citizenship Canada (IRCC).<\/li>\n<\/ul>\n<p><em><strong>GUIDELINES FOR START-UP COMPANIES<\/strong><\/em><\/p>\n<p>The start-up company must follow the stated requirements for Intra-Company Transferee. Firstly, the company must have a physical office to support the Canadian operation, mainly in the case of specific knowledge. The organization may use its counsel’s address until the executive can buy or sign an agreement for a physical office. Secondly, the company must secure genuine plans to staff the new operation and be economically stable for commencing its activities in Canada and paying the salary to its employees. Thirdly, when transferring executives or managers, the company must show that it will be large enough for supporting executive or management functions. Lastly, when moving a specialized expert and knowledgeable employee, the company must show that it is anticipated to be doing business and guarantee that work is guided and directed by management at the Canadian operation.<\/p>\n<p>Most importantly, the employee must be acceptable in Canada. If you would like to apply for a Canada work visa under Intra-Company Transferee, please <a href=\"https:\/\/www.elaarimmigration.ca\/contact-us\/\" target=\"_blank\" rel=\"noopener\">contact<\/a> the expert and licensed Canada immigration consultants at <a href=\"https:\/\/www.elaarimmigration.ca\/about-us\/\" target=\"_blank\" rel=\"noopener\">Elaar Immigration<\/a>. Reserve your consultation spot today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you working for an organization that has its parent company, subsidiary, branch or affiliate in Canada? If yes, you may be able to obtain a work permit in Canada&#8230;<\/p>\n","protected":false},"author":5,"featured_media":4969,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[254,135],"tags":[368,367,369,364,365,366],"_links":{"self":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/4967"}],"collection":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/comments?post=4967"}],"version-history":[{"count":7,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/4967\/revisions"}],"predecessor-version":[{"id":6633,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/4967\/revisions\/6633"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media\/4969"}],"wp:attachment":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media?parent=4967"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/categories?post=4967"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/tags?post=4967"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}