{"id":5303,"date":"2020-09-16T09:54:50","date_gmt":"2020-09-16T09:54:50","guid":{"rendered":"https:\/\/www.elaarimmigration.ca\/?p=5303"},"modified":"2021-10-19T10:15:03","modified_gmt":"2021-10-19T10:15:03","slug":"what-are-the-steps-for-the-provincial-nominee-program-pnp","status":"publish","type":"post","link":"https:\/\/www.elaarimmigration.ca\/blog\/what-are-the-steps-for-the-provincial-nominee-program-pnp\/","title":{"rendered":"What are the Steps for the Provincial Nominee Program (PNP)?"},"content":{"rendered":"<p>The Provincial Nominee Program (PNP) is one of the major pathways for Canada immigration. Provincial Nominee Program results from an agreement between the federal government of Canada and respective provincial governments. Since each province and territory understand their labour needs better than anybody else, the federal government allows them to select and nominate candidates as per their requirements. It is important to note here that provinces can only nominate candidates; only Canada&#8217;s federal government can grant permanent residency. Depending on each province&#8217;s size and industry requirements, provinces are allocated an annual quota for nomination and accordingly, provincial governments create and manage their respective provincial nominee programs.<\/p>\n<p>The <a href=\"https:\/\/www.elaarimmigration.ca\/provincial-nominee-program\/\">Provincial Nominee Program (PNP)<\/a> points out those skilled workers, independently employed individuals and business owners who can help develop that province&#8217;s job market. In Provincial Nominee Program (PNP), each region helps Canada to grow the economy, which profits the Canadians and, in return, offers social security benefits to the immigrants.<\/p>\n<p>The main interest of the Provincial Nominee Program (PNP) is to invite the skilled workforce having required credentials such as education, age, work experience, and language proficiency in at least one of the official languages, i.e. English or French. If one satisfies the program&#8217;s eligibility criteria, you may receive the nomination from the respective Canadian province, except Quebec.<\/p>\n<h3><span style=\"font-size: 20px; color: #000;\"><strong>What after being invited by the Canadian province?<\/strong><\/span><\/h3>\n<p>You earn extra 600 points once you are acknowledged by the PNP or issued the nomination certificate. Now, your CRS score will be among the highest in the pool of candidates waiting for the invite from IRCC. Consequently, in the next draw of <a href=\"https:\/\/www.elaarimmigration.ca\/express-entry\/\">Express Entry<\/a>, you&#8217;ll be invited to apply for a Canada PR visa. Once you successfully receive an Invitation to Apply (ITA), you have 90 days to submit your documents and other requirements such as proof of fund, medical certificate, etc. You must finish the document verification and submission in 90 days. In case a delay is caused, you might lose the opportunity of applying for your Canada PR.<\/p>\n<h2><span style=\"font-size: 20px; color: #000;\"><strong>Step by step guide to apply for PNP<\/strong><\/span><\/h2>\n<h2><span style=\"font-size: 20px; color: #000;\"><strong>STEP 1: Knowing your Eligibility<\/strong><\/span><\/h2>\n<p>Before applying for PNP, it is pertinent to understand if you are qualified for the same. Suppose you plan to apply for the British Columbia Provincial Nominee Program (BCPNP) or PNP of any other province or territory. In that case, you must check the eligibility criteria for each and determine which one applies to you. Also, remember that Quebec has its policies and eligibility criteria. Once you have selected the <a href=\"https:\/\/www.elaarimmigration.ca\/blog\/all-you-must-know-about-provincial-nominee-program\/\">most appropriate PNP program for yourself<\/a>, start collecting all the documents required for the application process. Do keep yourself updated on any changes as the prerequisites change without prior notice, and hence it&#8217;s essential to maintain a continuous check while applying.<\/p>\n<h2><span style=\"font-size: 20px; color: #000;\"><strong>STEP 2: Starting your Application Process<\/strong><\/span><\/h2>\n<p>There are two kinds of provincial nominee programs, i.e., those linked to the Express Entry system and others those are stand-alone provincial programs. The ones related to the Express Entry system primarily target experienced skilled workers who are eligible for any federal immigration programs such as the <a href=\"http:\/\/elaarimmigration.ca\/federal-skilled-worker-program\/\">Federal Skilled Worker Program<\/a>, Federal Skilled Trades Program or the Canadian Experience Class. The other provincial nominee programs are targeted towards applicants required by the provinces such as business owners, semi-skilled and unskilled workers, etc.<\/p>\n<p>The provinces invite the applicants through the Express Entry stream as well as non-Express Entry streams. Depending on your unique situation, your profile might be picked up from the Express Entry pool. You may get an invitation to apply by a particular province such as Ontario or Alberta. In such a case, you first have to apply for the respective PNP, followed by a PR application to the federal government through the Express Entry system. There might be another scenario wherein you are already in the Express Entry pool, and you apply at the PNP portal of provinces such as Saskatchewan and Nova Scotia. In the third scenario, you already work in a particular province or territory, and you can apply to the relevant provincial program in that province only. This program might be linked to the Express Entry system or a stand-alone provincial program. Once a province nominates you in all the above cases, you need to apply to Immigration, Refugees and Citizenship Canada (IRCC) for a Canada PR visa. It is mandatory to submit your medical reports to prove that you are fit and healthy during the application process.<\/p>\n<h2><span style=\"font-size: 20px; color: #000;\"><strong>STEP 3: Knowing the Application Processing Time for Different Provinces<\/strong><\/span><\/h2>\n<p>The IRCC sets different processing times for various Canada immigration programs. Hence, it is valid to know how much time your application will require to process. Before 2015, the processing times were not exact, as there was no online system.  But now, you&#8217;ll get to check the processing time of your application on the online platform.<\/p>\n<p>The application processing time is less for Express Entry linked PNP as compared to the non-Express Entry PNP. The application processing time is different for each province. One can check the application start time, closing time, and processing time on the province&#8217;s official site.<\/p>\n<h2><span style=\"font-size: 20px; color: #000;\"><strong>STEP 4: After Presenting your Application<\/strong><\/span><\/h2>\n<p>Once you submit your Provincial Nominee Program application, you have to follow specific guidelines. Firstly, you&#8217;ll receive an acknowledgment of your application. You will also receive a letter saying, &#8220;the administration is evaluating your application.&#8221; If you submit your application, which lacks a few qualification criteria, your application will not pass.<\/p>\n<p>If you have applied through a regulated Canada immigration consultant, such as Colossus Migration, your profile will be up to the mark. If you qualify for the PNP, you will receive an invite from the respective province. Once you receive the approval, you need to apply with IRCC for your Canada PR application.<\/p>\n<p>The Canada immigration authority might request you to submit further documents required to issue you an invite. Make sure you submit the documents before the end date. Once you get the province&#8217;s nomination, you&#8217;ll score extra 600 points if you have applied via the Express Entry linked stream.<\/p>\n<h2><span style=\"font-size: 20px; color: #000;\"><strong>STEP 5: Arranging your Travel to Canada<\/strong><\/span><\/h2>\n<p>If you apply for your PR application from outside of Canada, now is the time to live your desired life in Canada. Before travelling to Canada, you might contact a few companies\/non-profit organizations that help new immigrants settle in Canada. These organizations help you after landing in Canada. For the same, you can contact <a href=\"http:\/\/elaarimmigration.ca\/\">Colossus Migration<\/a> to know more about post landing services in Canada.<\/p>\n<p>Once you land in Canada, your Canada PR card would be mailed to your home address in a couple of months. The Canada PR card will be your entity in the country and hence keep it safe and close to you.<\/p>\n<p>A keynote here is that you must land and settle in the province which nominated you. Although the Canadian Charter of Rights provides the Right to Mobility to every individual, it is your moral duty to reside in the province that nominated you unless there is a compelling reason to move to another part of Canada.<\/p>\n<p>The provinces that participate in PNP are Ontario, British Columbia, Alberta, Saskatchewan,  New Brunswick, Manitoba,  Nova Scotia, Newfoundland and Labrador, Prince Edward Island, Northwest Territories and .. Each of these provinces has its PNP criteria, and hence it is recommended that before applying to any province, visit the province’s official website.<\/p>\n<p><strong>Getting in touch with Colossus Migration<\/strong><\/p>\n<p>To apply for Canada immigration via the Provincial Nominee Program (PNP), get in touch with our licensed Canada immigration consultants at Colossus Migration. They will assess your profile and recommend the best-suited PNP program out of more than 60 different programs and help you throughout the application process. Book your slot today with Colossus Migration to know more about Provincial Nominee Program (PNP) and other <a href=\"https:\/\/www.elaarimmigration.ca\/canada-immigration\/\">Canada immigration programs<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Provincial Nominee Program (PNP) is one of the major pathways for Canada immigration. Provincial Nominee Program results from an agreement between the federal government of Canada and respective provincial&#8230;<\/p>\n","protected":false},"author":5,"featured_media":5354,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[254],"tags":[259,258,157,171,172,173,150],"_links":{"self":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/5303"}],"collection":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/comments?post=5303"}],"version-history":[{"count":2,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/5303\/revisions"}],"predecessor-version":[{"id":6626,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/5303\/revisions\/6626"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media\/5354"}],"wp:attachment":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media?parent=5303"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/categories?post=5303"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/tags?post=5303"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}