{"id":5573,"date":"2020-11-09T19:27:51","date_gmt":"2020-11-09T19:27:51","guid":{"rendered":"https:\/\/www.elaarimmigration.ca\/?p=5573"},"modified":"2021-10-19T06:51:14","modified_gmt":"2021-10-19T06:51:14","slug":"ircc-issues-new-guidelines-for-dual-intent-for-overseas-spousal-sponsorship-applicants","status":"publish","type":"post","link":"https:\/\/www.elaarimmigration.ca\/blog\/ircc-issues-new-guidelines-for-dual-intent-for-overseas-spousal-sponsorship-applicants\/","title":{"rendered":"IRCC Issues New Guidelines for ‘Dual Intent’ for Overseas Spousal Sponsorship Applicants"},"content":{"rendered":"<p>The Immigration, Refugees and Citizenship Canada (IRCC) declared its new guidelines for dual intent on 30<sup>th<\/sup> October 2020. The news was about dual intent program delivery instructions for partners and spouses who have applied or may apply for Canada PR as a <a href=\"https:\/\/www.elaarimmigration.ca\/family-sponsorship\/spouse-common-law-partner\/\">sponsored partner or spouse<\/a>. According to <a href=\"https:\/\/www.elaarimmigration.ca\/canada-immigration\/\"><strong>Canadian immigration<\/strong><\/a> law, dual intent refers to the foreign nationals who can seek temporary residence and permanent residence in Canada at the same time. The news explains what factors the immigration officers will undergo while accessing the sponsored spouses&#8217; dual intent application. Dual intent is also applicable to the individuals who have applied for TRV.<\/p>\n<p>Dual intent is available when an individual has applied or may <a href=\"https:\/\/www.elaarimmigration.ca\/\">apply for Canada PR<\/a>. It also applies to enter Canada for a specific duration on a temporary visa as a student, visitor, or temporary worker.<\/p>\n<p>More clear rules for dual intent will probably help many existing students, visitors, and temporary worker who is willing to make Canada their home by gaining Canada PR, especially given the way that numerous Canadian immigration programs (programs to obtain Canada PR) reward people who have a Canadian degree or work experience in Canada.<\/p>\n<p>If the Canadian immigration official has concerns or questions about the candidate&#8217;s dual intent application, the official must make the candidate aware of these worries. After this, they can offer the candidate a chance to react to the worries. If temporary residence application is not approved, the official will furnish the candidate with a letter clarifying why the application is rejected.<\/p>\n<p>In evaluating an <a href=\"https:\/\/www.elaarimmigration.ca\/visitor-visa-eta-2\/\">application for temporary residence<\/a>, immigration officials are told to consider different factors such as:<\/p>\n<ul>\n<li>The total duration that an individual will spend in Canada;<\/li>\n<li>Means of support;<\/li>\n<li>Commitments and ties to the nation of origin;<\/li>\n<li>The reason to stay in Canada;<\/li>\n<li>The credibility and validity of documents, reports and data submitted;<\/li>\n<li>Past consistence with prerequisites of the IRPA and the Immigration and Refugee Protection Regulations (IRPR) that apply to temporary residents (students, visitors, and workers), and data accessible in biometric and biographic information sharing.<\/li>\n<\/ul>\n<p>If the temporary resident candidates do not show that they have the aim of leaving Canada, and the official just considers their objective to reside in Canada by obtaining Canada PR, their application will not be approved. Regardless of whether the candidate may consequently fit for <a href=\"https:\/\/www.elaarimmigration.ca\/canadian-experience-class\/\">Canadian Experience Class<\/a> (CEC) or a <a href=\"https:\/\/www.elaarimmigration.ca\/provincial-nominee-program\/\">Provincial Nominee Program<\/a> (PNP). The purpose behind this, IRCC says, is because the candidate has not demonstrated that they would regard the terms of temporary residence, should they be not fit for obtaining Canada PR.<\/p>\n<p>Canada immigration officials will utilize their judgment on applications with dual intent; however, the Global Case Management System notes should unmistakably exhibit the official&#8217;s thinking while applying. At the end of the day, if dual intent was considered a component of choice on the application, it should be written in the candidate&#8217;s file.<\/p>\n<p>Having two purposes — one for temporary residence and one for permanent residence — is authentic. Canada&#8217;s IRCC states: &#8220;An aim by a foreign national to obtain Canada PR does not disqualify them from becoming a temporary resident if the <a href=\"https:\/\/www.elaarimmigration.ca\/\">Canadian immigration<\/a> official is contented that they will leave Canada by the end of the period authorized for their stay.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Immigration, Refugees and Citizenship Canada (IRCC) declared its new guidelines for dual intent on 30th October 2020. The news was about dual intent program delivery instructions for partners and&#8230;<\/p>\n","protected":false},"author":5,"featured_media":5574,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[254,135],"tags":[324,272,173,150,327,326,325],"_links":{"self":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/5573"}],"collection":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/comments?post=5573"}],"version-history":[{"count":3,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/5573\/revisions"}],"predecessor-version":[{"id":6591,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/posts\/5573\/revisions\/6591"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media\/5574"}],"wp:attachment":[{"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/media?parent=5573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/categories?post=5573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.elaarimmigration.ca\/wp-json\/wp\/v2\/tags?post=5573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}